Saber = ['巴御前(Saber)', '狄俄斯库里', '阿斯托尔福(Saber)', '葛饰北斋(Saber)', '伊阿宋', '拉克西米·巴伊', '红阎魔', '兰陵王', '迪尔姆德·奥迪那(Saber)',
         '女王梅芙(Saber)', '齐格鲁德', '柳生但马守宗矩', '弗兰肯斯坦(Saber)', '铃鹿御前', '亚瑟·潘德拉贡[Prototype]', '宫本武藏', '伊丽莎白·巴托里[勇者]',
         '贝德维尔', '高文', '兰斯洛特(Saber)', '罗摩', '两仪式', '尼禄·克劳狄乌斯[新娘]', '莫德雷德', '弗格斯·马克·罗伊',
         '冲田总司', '骑士迪昂', '吉尔·德·雷', '阿蒂拉', '盖乌斯·尤利乌斯·恺撒', '齐格飞', '尼禄·克劳狄乌斯',
         '阿尔托莉雅·潘德拉贡[Alter]', '阿尔托莉雅·潘德拉贡[Lily]', '阿尔托莉雅·潘德拉贡']
Lancer = ['虞美人(Lancer)', '宇津见绘里世', '罗穆路斯·奎里努斯', '凯妮斯', '泳装莉莉丝', '加雷斯', '长尾景虎', '布拉达曼特', '秦良玉', '茨木童子(Lancer)', '瓦尔基里', '埃列什基伽勒',
          '哪吒', '宝藏院胤舜', '帕尔瓦蒂', '源赖光(Lancer)', '豹人', '美杜莎(Lancer)', '恩奇都', '贞德·Alter·Santa·Lily', '弗拉德三世[EXTRA]',
          '清姬(Lancer)', '玉藻前(Lancer)', '阿尔托莉雅·潘德拉贡[Alter](Lancer)', '李书文', '布伦希尔德', '芬恩·麦克库尔', '迦尔纳',
          '阿尔托莉雅·潘德拉贡(Lancer)',
          '迪尔姆德·奥迪那', '斯卡哈', '赫克托耳', '罗穆路斯', '列奥尼达一世', '库·丘林[Prototype]', '武藏坊弁庆',
          '伊丽莎白·巴托里', '库·丘林', ]
Archer = ['伊莉雅丝菲尔·冯·爱因兹贝伦(Archer)', '清少纳言', '超人俄里翁', '南丁格尔[圣诞]', '灾星简', '刑部姬(Archer)', '帕里斯', '马嘶', '威廉·退尔',
          '贞德(Archer)', '拿破仑', '喀戎', '浅上藤乃', '阿蒂拉·the·San[ta]', '巴御前', '海伦娜·布拉瓦茨基(Archer)', '卫宫', '莫里亚蒂', '伊什塔尔',
          '克洛伊·冯·爱因兹贝伦',
          '安妮·伯妮＆玛莉·瑞德(Archer)', '阿尔托莉雅·潘德拉贡(Archer)', '俵藤太', '崔斯坦', '比利小子', '幼吉尔', '阿周那', '尼古拉·特斯拉',
          '织田信长', '大卫', '俄里翁', '阿拉什', '尤瑞艾莉', '阿塔兰忒', '罗宾汉', '吉尔伽美什', '卫宫[Alter]', ]
Rider = ['紫式部(Rider)', '奥德修斯', '欧罗巴', '曼迪卡尔多', '卡米拉(Rider)', '巴沙洛缪·罗伯茨', '莱昂纳多·达·芬奇(Rider)', '司马懿[莱妮丝]', '赤兔马',
         '坂本龙马', '阿喀琉斯', '伊凡雷帝', '伊什塔尔(Rider)', '阿尔托莉雅·潘德拉贡[Alter]', '哥伦布', '魁札尔·科亚特尔',
         '莫德雷德(Rider)', '奥斯曼狄斯', '坂田金时(Rider)', '伊斯坎达尔', '女王梅芙', '阿斯托尔福', '阿尔托莉雅·潘德拉贡[圣诞Alter]',
         '安妮·伯妮＆玛莉·瑞德', '弗朗西斯·德雷克', '玛尔达', '玛丽·安托瓦内特', '亚历山大', '牛若丸', '布狄卡',
         '爱德华·蒂奇', '乔尔乔斯', '美杜莎']
Caster = ['阿尔托莉雅·Caster', '陈宫', '阿斯克勒庇俄斯', '紫式部', '美游·艾德费尔特', '酒吞童子(Caster)', '斯卡哈·斯卡蒂', '齐格',
          '阿维斯布隆', '阿纳斯塔西娅', '示巴女王', '喀尔刻', '尼禄·克劳狄乌斯(Caster)', '山鲁佐德', '梅林', '吉尔伽美什(Caster)',
          '伊莉雅丝菲尔·冯·爱因兹贝伦', '玛丽·安托瓦内特(Caster)', '莱昂纳多·达·芬奇', '尼托克丽丝', '玄奘三藏', '爱丽丝菲尔[天之衣]',
          '杰罗尼莫', '托马斯·爱迪生', '海伦娜·布拉瓦茨基', '查尔斯·巴贝奇', '冯·霍恩海姆·帕拉塞尔苏斯', '童谣', '美狄亚(Lily)',
          '玉藻前', '伊丽莎白·巴托里[万圣节]', '库·丘林(Caster)', '诸葛孔明', '沃尔夫冈·阿马德乌斯·莫扎特', '梅菲斯托费勒斯', '威廉·莎士比亚',
          '汉斯·克里斯蒂安·安徒生', '吉尔·德·雷(Caster)', '美狄亚']
Assassin = ['冲田·J·总司', '夏绿蒂·科黛', '格蕾', '迦摩', '李书文(Assassin)', '虞美人', '牛若丸(Assassin)', '冈田以藏', '塞弥拉弥斯', '刑部姬',
            '加藤段藏',
            '尼托克丽丝(Assassin)', '武则天', '燕青', '“山中老人”', '克娄巴特拉', '斯卡哈(Assassin)', '静谧哈桑', '风魔小太郎', '酒吞童子', '百貌哈桑',
            '卫宫[Assassin]', '两仪式(Assassin)',
            '谜之女主角X', '亨利·杰基尔＆海德', '开膛手杰克', '卡米拉', '玛塔·哈丽', '剧院魅影', '夏尔·亨利·桑松', '荆轲', '斯忒诺',
            '咒腕哈桑', '佐佐木小次郎']
Berserker = ['布伦希尔德(Berserker)', '鬼女红叶', '宫本武藏(Berserker)', '莎乐美', '森长可', '阿周那[Alter]', '项羽', '贞德[Alter](Berserker)', '阿塔兰忒[Alter]',
             '织田信长(Berserker)', '保罗·班扬', '彭忒西勒亚',
             '茶茶', '土方岁三', '谜之女主角X[Alter]', '茨木童子', '源赖光', '库·丘林[Alter]', '南丁格尔', '贝奥武夫', '弗兰肯斯坦', '玉藻猫',
             '血斧埃里克', '清姬', '大流士三世', '卡利古拉', '阿斯忒里俄斯', '弗拉德三世', '坂田金时', '斯巴达克斯', '吕布奉先',
             '兰斯洛特', '赫拉克勒斯']
MoonCancer = ['杀生院祈荒(MoonCancer)', '伟大的石像神', '泳装BB', 'BB']
Ruler = ['阿尔托莉雅·潘德拉贡(Ruler)', '阿斯特赖亚', '魁札尔·科亚特尔[桑巴圣诞]', '始皇帝', '夏洛克·福尔摩斯', '玛尔达(Ruler)',
         '天草四郎', '贞德']
Avenger = ['宇宙伊什塔尔', '织田信长(Avenger)', '安东尼奥·萨列里', '海森·罗伯', '戈耳工', '安哥拉曼纽', '贞德[Alter]', '岩窟王']
AlterEgo = ['Kingprotea', '志度内', '冲田总司[Alter]', '机械伊丽亲', '机械伊丽亲Ⅱ号机', '杀生院祈荒', 'Passionlip', 'Meltryllis']
Shielder = ['玛修·基列莱特']
Foreigner = ['阿比盖尔·威廉姆斯[夏]', '旅行者', '杨贵妃', '谜之女主角XX', '葛饰北斋', '阿比盖尔·威廉姆斯']
